[
    {
        "id": 1,
        "text": "شَهْرُ رَمَضَانَ الَّذِي أُنزِلَ فِيهِ الْقُرْآنُ هُدًى لِّلNَّاسِ وَبَيِّنَاتٍ مِّنَ الْهُدَىٰ وَالْفُرْقَانِ",
        "surah": "البقرة: 185",
        "tafsir": "يمتدح الله تعالى شهر الصيام من بين سائر الشهور بأن اختاره لإنزال القرآن العظيم فيه."
    },
    {
        "id": 2,
        "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ",
        "surah": "البقرة: 183",
        "tafsir": "فُرض عليكم الصيام كما فُرض على الأمم السابقة، وله حكمة عظيمة وهي تحقيق التقوى."
    },
    {
        "id": 3,
        "text": "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ",
        "surah": "البقرة: 186",
        "tafsir": "الله قريب من عباده، يسمع دعاءهم ويستجيب لهم، خاصة في أوقات العبادة كالصيام."
    },
    {
        "id": 4,
        "text": "إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ",
        "surah": "القدر: 1",
        "tafsir": "يخبر الله تعالى أنه أنزل القرآن جملة واحدة في ليلة مباركة وهي ليلة القدر."
    },
    {
        "id": 5,
        "text": "لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ",
        "surah": "القدر: 3",
        "tafsir": "العبادة في هذه الليلة تعادل في الأجر عبادة ألف شهر ليس فيها ليلة القدر."
    },
    {
        "id": 6,
        "text": "وَكُلُوا وَاشْرَبُوا حَتَّىٰ يَتَبَيَّنَ لَكُمُ الْخَيْطُ الْأَبْيَضُ مِنَ الْخَيْطِ الْأَسْوَدِ مِنَ الْفَجْرِ",
        "surah": "البقرة: 187",
        "tafsir": "أباح الله الأكل والشرب في ليالي رمضان حتى يطلع الفجر الصادق."
    },
    {
        "id": 7,
        "text": "أَيَّامًا مَّعْدُودَاتٍ",
        "surah": "البقرة: 184",
        "tafsir": "الصيام مفروض في أيام قليلة العدد، سهلة على النفوس، وهي أيام شهر رمضان."
    },
    {
        "id": 8,
        "text": "وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ",
        "surah": "البقرة: 45",
        "tafsir": "اطلبوا العون من الله بالصبر على الطاعات والصلاة، وهي شاقة إلا على من خشع قلبه."
    },
    {
        "id": 9,
        "text": "إِنَّ الْمُصَّدِّقِينَ وَالْمُصَّدِّقَاتِ وَأَقْرَضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعَفُ لَهُمْ وَلَهُمْ أَجْرٌ كَرِيمٌ",
        "surah": "الحديد: 18",
        "tafsir": "المتصدقون بأموالهم يضاعف الله لهم الحسنات ويدخر لهم أجراً عظيماً في الآخرة."
    },
    {
        "id": 10,
        "text": "وَسَارِعُوا إِلَىٰ مَغْفِرَةٍ مِّن رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا السَّمَاوَاتُ وَالْأَرْضُ أُعِدَّتْ لِلْمُتَّقِينَ",
        "surah": "آل عمران: 133",
        "tafsir": "بادروا بالأعمال الصالحة لتنالوا مغفرة الله وتدخلوا جنة واسعة أعدها للمتقين."
    },
    {
        "id": 11,
        "text": "الَّذِينَ يُنفِقُونَ فِي السَّرَّاءِ وَالضَّرَّاءِ وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ ۗ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ",
        "surah": "آل عمران: 134",
        "tafsir": "صفات المتقين الإنفاق في كل حال، وكظم الغضب، والعفو عن المسيء، والله يحب أهل الإحسان."
    },
    {
        "id": 12,
        "text": "قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا",
        "surah": "الزمر: 53",
        "tafsir": "دعوة للتوبة وعدم اليأس، فالله يغفر جميع الذنوب لمن تاب وأناب إليه."
    },
    {
        "id": 13,
        "text": "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ",
        "surah": "البقرة: 152",
        "tafsir": "داوموا على ذكري بالطاعة أذكركم بالثواب، واشكروا نعمي ولا تجحدوها."
    },
    {
        "id": 14,
        "text": "إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا",
        "surah": "الأحزاب: 56",
        "tafsir": "أمر من الله للمؤمنين بالإكثار من الصلاة والسلام على النبي محمد صلى الله عليه وسلم."
    },
    {
        "id": 15,
        "text": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
        "surah": "البقرة: 201",
        "tafsir": "دعاء جامع لخيري الدنيا والآخرة والنجاة من النار، وكان من أكثر دعاء النبي."
    },
    {
        "id": 16,
        "text": "الم * ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِّلْمُتَّقِينَ",
        "surah": "البقرة: 1-2",
        "tafsir": "القرآن كتاب عظيم لا شك أنه من عند الله، وهو هداية للمتقين الذين يخشون ربهم."
    },
    {
        "id": 17,
        "text": "تَتَجَافَىٰ جُنُوبُهُمْ عَنِ الْمَضَاجِعِ يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ",
        "surah": "السجدة: 16",
        "tafsir": "وصف للمتهجدين الذين يتركون النوم لقيام الليل ودعاء الله والإنفاق في سبيله."
    },
    {
        "id": 18,
        "text": "وَالَّذِينَ هُمْ عَلَىٰ صَلَوَاتِهِمْ يُحَافِظُونَ",
        "surah": "المؤمنون: 9",
        "tafsir": "من صفات المؤمنين المفلحين أنهم يداومون على أداء الصلوات في أوقاتها بخشوع."
    },
    {
        "id": 19,
        "text": "إِنَّمَا يَتَقَبَّلُ اللَّهُ مِنَ الْمُتَّقِينَ",
        "surah": "المائدة: 27",
        "tafsir": "الله يقبل الأعمال الصالحة ممن اتقاه وأخلص النية له سبحانه."
    },
    {
        "id": 20,
        "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنظُرْ نَفْسٌ مَّا قَدَّمَتْ لِغَدٍ",
        "surah": "الحشر: 18",
        "tafsir": "أمر بمحاسبة النفس والاستعداد ليوم القيامة بالأعمال الصالحة."
    },
    {
        "id": 21,
        "text": "وَأَن تَصُومُوا خَيْرٌ لَّكُمْ ۖ إِن كُنتُمْ تَعْلَمُونَ",
        "surah": "البقرة: 184",
        "tafsir": "الصيام فيه خير عظيم لكم في دينكم ودنياكم وصحتكم إن كنتم تدركون ذلك."
    },
    {
        "id": 22,
        "text": "وَبِالْأَسْحَارِ هُمْ يَسْتَغْفِرُونَ",
        "surah": "الذاريات: 18",
        "tafsir": "من صفات المحسنين أنهم يحيون أوقات السحر (قبيْل الفجر) بالاستغفار والدعاء."
    },
    {
        "id": 23,
        "text": "قَدْ أَفْلَحَ مَن تَزَكَّىٰ * وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّىٰ",
        "surah": "الأعلى: 14-15",
        "tafsir": "الفوز لمن طهر نفسه من الذنوب، وأكثر من ذكر الله، وحافظ على الصلاة."
    },
    {
        "id": 24,
        "text": "وَالضُّحَىٰ * وَاللَّيْلِ إِذَا سَجَىٰ",
        "surah": "الضحى: 1-2",
        "tafsir": "قسم من الله بوقت الضحى والليل إذا سكن، دلالة على أهمية الزمن والعبادة فيه."
    },
    {
        "id": 25,
        "text": "إِنَّ الصَّلَاةَ تَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنكَرِ ۗ وَلَذِكْرُ اللَّهِ أَكْبَرُ",
        "surah": "العنكبوت: 45",
        "tafsir": "الصلاة الحقيقية تمنع صاحبها من المعاصي، وذكر الله أعظم ما يتقرب به العبد."
    },
    {
        "id": 26,
        "text": "فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ",
        "surah": "الزلزلة: 7",
        "tafsir": "كل عمل صالح مهما كان صغيراً سيجده العبد في ميزانه يوم القيامة."
    },
    {
        "id": 27,
        "text": "وَتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوَىٰ",
        "surah": "البقرة: 197",
        "tafsir": "استعدوا للآخرة بالأعمال الصالحة، فإن تقوى الله هي أفضل ما يتزود به المؤمن."
    },
    {
        "id": 28,
        "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْرًا كَثِيرًا",
        "surah": "الأحزاب: 41",
        "tafsir": "أمر للمؤمنين بالمداومة على ذكر الله في كل الأوقات وعلى كل الأحوال."
    },
    {
        "id": 29,
        "text": "ادْعُوا رَبَّكُمْ تَضَرُّعًا وَخُفْيَةً ۚ إِنَّهُ لَا يُحِبُّ الْمُعْتَدِينَ",
        "surah": "الأعراف: 55",
        "tafsir": "ادعوا الله بخشوع وإخلاص، ولا ترفعوا أصواتكم فوق الحاجة، فالله يحب الخاشعين."
    },
    {
        "id": 30,
        "text": "وَسِيقَ الَّذِينَ اتَّقَوْا رَبَّهُمْ إِلَى الْجَنَّةِ زُمَرًا",
        "surah": "الزمر: 73",
        "tafsir": "يُكرم الله المتقين يوم القيامة بأن يسوقهم إلى الجنة جماعات مكرمين معززين."
    }
]